package n8;

/**
 * Реализовать приложение “Комната с Лампочкой”. Пользователь заходит на сайт (web страница) и выбирает комнату, в
 * которую хочет войти (из списка или просто вводит с клавиатуры). После выбора комнаты пользователь видит лампочку,
 * которую можно либо включить, либо выключить. UI должен позволять сделать это.
 * Если другой пользователь зайдет в ту же комнату - он должен увидеть такое же состояние лампочки, что и первый. Это
 * означает, в комнате могут находится несколько человек и состояние лампочки для них будет одно и то же. Если кто-то
 * выключит лампочку - остальные это немедленно увидят. Комнат может быть несколько.
 * UI может быть очень простым, это неважно для решения.
 * Стек технологий - по выбору. Но на сервере обязательно Java.
 * Решение можно оформить в виде отдельного приложения/проекта.
 */
public class Main {
}
